[
    {
        "name": "Undergraduate Research Assistant",
        "date": "Dec 2021 - Dec 2024",
        "company": "Computational Ecology Lab at UC Santa Cruz",
        "description": "I performed research in efficient connectivity computation for bird species in Python/PyTorch and R, building methods for processing geospatial data and automating input layer generation for our novel connectivity computation algorithm."
    },
    {
        "name": "Lead Web Developer",
        "date": "Sep 2023 - Dec 2024",
        "company": "Tech4Good Lab at UC Santa Cruz",
        "description": "Over several academic quarters, I led 50+ students in learning web development by collaboratively building web applications for research initiatives in social computing.",
        "link": "https://tech4good.soe.ucsc.edu/"
    },
    {
        "name": "Software Engineering Intern",
        "date": "June 2023 - Aug 2023, June 2024 - Aug 2024",
        "company": "NASA Jet Propulsion Laboratory (JPL)",
        "description": "I participated in two internships at JPL, in which I worked with the Deep Space Network Emulator (DSNE) team to produce automation software for creating DSNE configuration files and test scripts."
    },
    {
        "name": "Google Summer of Code Mentor",
        "date": "Apr 2024 - Sep 2024",
        "company": "UC Santa Cruz Open Source Program Office (UCSC OSPO)",
        "description": "I mentored two Google Summer of Code participants in building Causeway, a web application that teaches learners web development using a microrole-based structure, and Compass Goals, one of the exemplar application used in Causeway.",
        "link": "https://causeway.web.app/"
    },
    {
        "name": "Pintos Projects",
        "date": "Apr 2024 - June 2024",
        "description": "I collaborated with a partner on Stanford's Pintos projects, which involved implementation of support for user programs, virtual memory, and file systems in an existing operating system."
    },
    {
        "name": "Kakaw!",
        "date": "Apr 2023 - June 2023",
        "description": "I worked in a team of six to produce Kakaw!, an application that facilitates learning and review via live quiz sessions.",
        "link": "https://kakaw.190n.dev"
    }
]